[
  {
    "id": 99999,
    "title": "Update 1.0",
    "date": "2025-08-04",
    "summary": "In this article, I highlight some changes and bug fixes based on user suggestions and things I've found while the website is live. Thank you again for the support and sending your thoughts and suggestions and things you want to see improved and implemented! (THIS IS A TEST FOR NOW)",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": true
  },
  {
    "id": 100000,
    "title": "Welcome to the Website!",
    "date": "2025-06-16",
    "summary": "Welcome to my website! In this quick guide, I'll layout my intentions, motiviations, and some features that exist here. Feel free to comment on this post or anonymously via the feedback box on the blog landing page for thoughts and suggestions. Thanks for visiting!",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": true
  },
  {
    "id": 0,
    "title": "Recapping a Wild Trade Deadline",
    "date": "2025-08-01",
    "summary": "The 2025 MLB Trade Deadline has come and gone, and what a wild deadline we saw! Let's recap everything we saw, single out some early winners and losers, and how this affects the outlook for the rest of the season as we march towards the playoffs.",
    "image": "/img/dummyimage.png",
    "content": "This year's trade deadline was hectic and busy, providing the fans with one of the more memorable and 'great' trade deadlines in recent memory. Teams went all in, teams stood pat, others looked to rebuild for the future, and others are left our heads scratching. Let's take a closer look at the big moves and the outlook of this year's biggest players.\r\n\r\nI think the best place to start is with the biggest trade of the deadline, or at least one that got many heads spinning and people talking. It's the Padres trade for Mason Miller. The full trade was RHP closer Mason Miller to the Padres along with LHP starter JP Sears for 3 pitching prospects, Braden Nett, Henry Baez, and Eduarniel Núñez, with the focal point of the trade consensus #3 prospect in all of baseball per Baseball of America SS Leodalis De Vries. This trade rocked the baseball world, especially with  AJ Preller's aggression to get his guy, a young electric backend arm in Miller to join an already loaded Padres bullpen. Preller's willingness to part with a top prospect, one that's arguably baseball's top prospect, certainly received some mixed reviews, as some argue that trading such an asset for a reliever, no matter if a household name or how good he is, would in the long run be worth it. But AJ Preller doesn't care about the long run. He has a team that he believes can win **now**, and his willingness to push his chips to the middle of the table and cash in on win-now assets is in my opinion respectable and admirable - it's something that almost no other GM in baseball would do. The Padres also added 2 bats, acquiring DH Ryan O'Hearn and OF Ramon Laureano from the Orioles, providing extra depth and respectable bats to an already potent lineup.\r\n\r\nI highlighted how the Padres now have a 'super pen', and they're not the only team to go this route (more on that later), but on the other side, for the A's, the future is certainly bright. I was part of the crowd coming into the season that believed that the A's with their young core can cause a few surprises, and maybe come the end of the year be in an outside-looking-in close fight for a wildcard spot. While this season hasn't gone exactly to that plan, there's still a lot of optimism for the A's. Yes, from a plain black-and-white lens, it does seem like the A's of old, trading away an All Star talent, like Matt Olson, Matt Champan, Marcus Semien, for prospects that we can agree, haven't panned out. However, to get the #3 prospect, who can be argued can be the #1 prospect, to slot into an infield that boasts the likely American League Rookie of the Year in Jacob Wilson, as well as likely runner up or top 3 finisher in AL ROY Nick Kurtz, de Vries can be part of a young, budding A's core that can bring them back to the spotlight. Especially if he pans out, in a premier position, as a 'Francisco Lindor' type with more power, there's a lot to be excited for in this young project even though they currently, and for the past few seasons, are at the bottom of their division.\r\n\r\nI alluded to the idea of 'super pens' previously, and two other teams that have gone this route are both New York teams. Let's start with the Mets, who have traded for rentals in Ryan Helsley and Tyler Rogers. The back end of their bullpen looks to be really strong, with closer Edwin Diaz locking down the final 3 outs. In addition, they added CF Cedric Mullins from the Orioles to strengthen their outfield, and their center field hole in particular. Perhaps some fans are a bit concerned or dissapointed that they did not add a starter, but the market never shaped itself to be a starter's market, and pivoting to the bullpen is, in my opinion, a very strong move considering the importance of pitching, especially in the playoffs.\r\n\r\nMoving on to the other New York team, the Yankees did a similar route, trading for 3 big time bullpen pieces while also addressing needs at 3B and depth and utility pieces. Prior to the deadline, the Yankees acquired 3B Ryan McMahon from the Rockies, and that trade has already paid dividends as there's a night and day difference in both defense and production from third, something the Yankees desperately needed. They also acquired SS Ahmed Rosario from the Nationals and CF Austin Slater from the White Sox, two bats that hit lefties well and can serve as good depth pieces. On deadline day, they traded for another backup SS / utility in Jose Cabellero from the Rays, and they headlined their bullpen overhaul by acquiring RHP closers David Bednar and Camilo Doval from the Pirates and Giants respectively, and RHP Jake Bird from the Rockies. The Yankees bullpen changed overnight, giving manager Aaron Boone many options in the backend with Bednar and Doval joining the likes of Weaver and Williams. Perhaps the cherry on top of the Yankees' deadline was that GM Brian Cashman was able to keep their top prospects in George Lombard Jr, Spencer Jones, and Cam Schlittler, all of whom were being asked for by other teams.\r\n\r\nBut perhaps, in my opinion, the *best* move of the deadline - the Phillies acquiring Jhoan Duran from the Twins. Perhaps not the biggest trade in terms of hype or news surrounding it, but Duran in my opinion was the best reliever or closer available in the market, and to join a Phillies team that's firing on all cylinders, and outside of perhaps needing help in the outfield, seemed pretty set, having a flamethrower of a closer to lock down the final 3 outs of any game, especially in the playoffs, is gamechanger. The Phillies, of course, also added OF Harrison Bader, which should help their need in the outfield, as they lacked the production from there all season long, and Bader this year, has had a bounceback of sorts and has been productive.\r\n\r\nMoving away quickly from pitching, the Mariners reunited with Eugenio Suarez, in what turned out to be a lack of a bidding war for the thirdbaseman, and also paired him with his teammate this year in Arizona in Josh Naylor. The Mariners massively upgraded their lineup, which now boasts home run leader Cal Raleigh, Randy Arozarena, and Julio Rodriguez. Pairing that with their excellent pitching staff, they're poised to make some noise in both the division and in October.\r\n\r\nHowever, speaking of the Twins, it was quite the firesale we witnessed. 11 total trades, one of which included trading SS Carlos Correa back to his former team in the Houston Astros *while* still taking on some of the salary, speaks volumes as to where this franchise is headed in the next few seasons. Maybe because of new ownership they wanted to start with a blank slate, but selling off almost every key piece of your team bar Byron Buxton and Joe Ryan certainly is a major blow to the morale of the players and their loyal diehard fans. And speaking of Joe Ryan, perhaps the marquee starter that was floated around to be dealt, was not dealt, creating drama and confusion especially among the Red Sox faithful, who believed that the deal was completed when MLB on Fox incorrectly tweeted that the deal had gone through, just for news to surface after the deadline passed that it 'was not even close.'\r\n\r\nCertainly a wild deadline, and strengthening the bullpens were certainly a theme. For winners, I'd definitely say both the Padres and the A's won, as the Padres strengthened an already deep bullpen, while the A's lock down their future infield. The Yankees and the Mets are also winners in my opinion, as although neither team got a starter, their bullpens both drastically improved, and they also addresssed certain needs, like the Yankees' need for a thirdbaseman and the Mets' need for a centerfielder. The Phillies also had a great deadline, despite not making a plethora of moves, but that's because they didn't need to. But the moves they made were certainly impactful, and to add what's in my opinion the best closer on the market to a team who's lineup is producing and starting rotation is dominating, that's a recipe for success. \r\n\r\nOther teams that I didn't really mention who I thought had a good deadline were the Blue Jays, adding Shane Bieber, though injured and hasn't pitched in a year, if he can get any sort of semblance of his former self, that's a good move. I really do like the Blue Jays moves, but I think that they don't get talked about enough as they get overshadowed by what the Yankees did, as well as what the Red Sox weren't able to do. Lastly, to round off, I think the Mariners obviously had a great deadline, and I would also throw the Astros there. They're getting Yordan Alvarez soon, as well as Jeremy Pena, and with Correa's willingness to play 3rd for his former team, one that he experienced so much success with, should put Houston right back on track to possibly another ALCS appearence. \r\n\r\nAs for losers, I'd definitely put the Red Sox there. Their trade deadline included Steven Matz and Dustin May, moves that certainly didn't 'wow' the fanbase, especially given how aggressively (or non aggressively, based on who's reporting) they persued Joe Ryan. What stings even more for the Red Sox was that they missed out on Ryan, while also seeing teams around them in both the division, in the Blue Jays and Yankees, and even the Rays acquiring Griffin Jax, as well as in the Wild Card, in The Mariners and the Texas Rangers, who added Merrill Kelly, all improve to varying degrees around them. Other losers in my opinion include the Twins, who's firesale was devastating, and with a lack of exciting or top prospects in their farm system really leaves a bleak future ahead, as well as the Angels, who once again had a head-scratching deadline, and given the buyer's market in relief pitchers, question marks surround their decision to stand pat with Kenley Jansen.\r\n\r\nOf course, these are just preliminary gut reactions to the trade deadline. These winners or losers are simply based off the names moved and to what team. Now, it's on the teams to translate these moves on the field to determine who really won or lost, and it's certainly shaping up to be an exciting race in these final two months of the season.",
    "pinned": false
  },
  {
    "id": 1,
    "title": "With the Trade Deadline One Week Away, the Market Remains as Unclear as Ever",
    "date": "2025-07-23",
    "summary": "There is 1 weeek until this year's trade deadline, and only a handful of teams are clear sellers. With so many teams still in the mix, how much can change before the 31st, and how will it affect the market?",
    "image": "/img/dummyimage.png",
    "content": "The MLB trade deadline is 8 days away, and there's a lot of question marks surrounding a market that, in comparison to past seasons, is slower and more unclear than ever before. With the expansion of the playoff format introduced a few seasons ago, more teams find themselves in the mix, and only a handful of teams in each league as of right now can definitively call themselves sellers. \r\n\r\nA big talking point surrounding this year's deadline is Diamondbacks 3B Eugenio Suarez, who at the age of 34 is lighting up baseball with 36 so far this year, tied with potential future teammate Aaron Judge in second in the league, behind Cal Raleigh's 39. The dilemma surrounding him is not whether or not it would be worth trading for 2 months of a high power but high strikeout bat, but what would the package look like. \r\n\r\nIn the case of the Yankees, one team picked out as a favorite to land the 3B, who's need at 3rd base is as clear as day, with their 3B ranks this season hanging among league worst, Suarez would definitely be a substantial upgrade to what they already have. But would it be worth potentially trading the likes of Spencer Jones, who is setting AAA alight, batting over .400 with an OPS north of 1.300, for two months of Suarez, who will plug that hole in 3B, but again, isn't a premier defensive third baseman, and falls into sort of the Yankees 'trap' of the last decade of filling a lineup with high power but high strikeout, a recipe that has continually been exposed by superior pitching in the postseason. Both sides of the coin are interesting, as undoubtedly, Suarez is an upgrade, but the risk is there, as well as trading Spencer Jones, as the situation may end up being eerily reminiscent of the Mets trading Pete Crow-Armstrong, now a budding star in the league, for 2 months of Javier Baez. Perhaps a package deal for Suarez, and one of Merrill Kelly or Zac Gallen, also in walk years, is what the Yankees are looking for, however the risk of rentals has come back to bite them in previous years, as recently as this past winter.\r\n\r\nSuarez, conversely, would be an interesting fit in Seattle, who's pitching, as projected coming into this year, is almost singlehandedly (other than Cal Raleigh's heroics), keeping them in the AL wildcard picture. Suarez, who spent 2 years before his Arizona tenure, in Seattle would be familiar with the scene, and though the second of those two years saw him underperform with an OPS in the .700s, the first year was still very productive, with him hitting over 31 homers on the year. But again, in that ball park, and the high swing and miss potential that Suarez has, is that something the Mariners front office wants to revisit? \r\n\r\nI've spent a lot of time talking about Eugenio Suarez, and deservedly so I'd say, as he's the headliner in an unclear market. And again, he may not even be dealt to either of the two teams I've mentioned. It all comes down to whatever package Arizona deems the best for their situation, as although they are trending towards losing Suarez in the midst of them trying to battle back in the standings, they do have his replacement, Jordan Lawlar, eagerly waiting in AAA.\r\n\r\nOne other interesting perspective is that Suarez may singlehandedly pull the Diamondbacks (sitting at 50-50) into the wildcard race, as they are one of those 'gray-area' in between teams that's hard to diagnose whether or not they are sellers. There is an argument to be had that especially following Suarez's scalding hot start following the All Star break, Arizona may find themselves in a position where they can justify to themselves that they are buyers. Other teams in similar positions include the Angels, Rays, Twins and Royals, who have some leapfrogging to do in the standings to propel themselves into wildcard spots, but it's not entirely out of the question, especially if they play well the next 8 days. Team's futures for this season and beyond seemingly rely on how they perform on the field in this one week span, setting up an intriguing deadline as teams will quickly find out their respective current state of affairs.",
    "pinned": false
  },
  {
    "id": 2,
    "title": "MLB's Pitching Epidemic",
    "date": "2025-07-20",
    "summary": "In an era where pitching, especially starting pitching, is more important than ever, teams, and marquee names, are struggling to stay on the field. Is the league truly at a point in its evolution where your team's ace will inevitably suffer a season ending injury?",
    "image": "/img/dummyimage.png",
    "content": "In the current day and age in today's game, pitching, especially top notch starting pitching, is paramount, and is often the key difference between winning and losing. A formula that really was kicked started in the late 2010s by the Houston Astros, every championship team in the last few seasons had a mix of a strong starting staff, lockdown bullpens, or a dominant ace (or two). \r\n\r\nHowever, as pitchers evolve and spin the ball more, generate more velocity, and become even harder to hit, the quicker do many find themselves on the IL, or even worse, out for the season. The last few seasons has seen some of the game's greatest aces undergo Tommy John surgery, such as Jacob deGrom, Spencer Strider, and most recently, Gerrit Cole. It seems almost at this point, that it's inevitable, rather than avoidable, that your team's number 1 will have to suffer the same fate - a scary reality for the game.\r\n\r\nYear after year big names go down, and for the case of a team like the Dodgers, whose team and especially pitching staff on paper is among the league's very best, have yet to see their big offseason signing and 2 time CY Young award winner Blake Snell see the mound. After poaching the left hander from the rival Padres, signing international free agent Roki Sasaki from Japan, and other moves in the lineup to bolster a championship roster, it was almost a foregone conclusion by many that the Dodgers would waltz their way back to the Fall Classic, at a minimum.\r\n\r\nBut after a strong start, the Dodgers of late have faltered, losing 11 of their last 14, including being swept by the Brewers twice, once before the All Star break, and once again after. And yes, while the lineup is struggling, it's no secret that they are severely suffering from injury, especially on the mound. A potential 4 headed monster in the rotation of Snell, Glasnow, Sasaki, and Yamamoto has all but been imagination up until this point, with Yamamoto being the only one of the four to be healthy and consistent this season. Snell, as previously mentioned, has battled injury and has yet to pitch for the Dodgers, while Sasaki was shut down after a few starts into the season. In addition, key bullpen arms Michael Kopech, Blake Treinen, Bursdar Graterol, Kyle Hurt, and Evan Phillips find themselves on the 60 day IL, along with starter River Ryan. Glasnow, as well as Shohei Ohtani, have only recently worked their way back, with the Dodgers extremely careful with the latter given his own injury history on the mound. Even Clayton Kershaw, who worked his way back from injury to eclipse 3,000 strikeouts, has had his fair share of injury problems, especially in the last few years as he has continued to age. But as LA looks to right the ship, a key concern is if they have the arms to do it.\r\n\r\nThis isn't just a Dodgers problem though, it's a league wide problem. When Gerrit Cole experienced forearm tightness in Spring Training after a few sub par starts (even for Spring Training standards), many knew what was coming once that news broke. And of recent for the reigning American League champions, Clarke Schmidt suffered the same fate. They also have yet to see reigning AL Rookie of the Year winner Luis Gil, who is only know getting ready for his first rehab appearance.\r\n\r\nAround the league, the injuries area widespread. The Diamondbacks lost their free agent acquisition and 2024 AL CY Young nominee Corbin Burnes. The Braves got back Spencer Strider, but the zip isn't quite there compared to his pre-injury starts, though he is slowly ramping himself back up. His counterpart, and reigning NL CY Young winner, Chris Sale is currently sidelined (though not an arm injury but rather a rib injury as a result of diving to catch a popup). Bryce Miller finds himself on the 15 day IL for the Mariners. Aaron Nola hasn't been himself for the Phillies this season, and has been on the 60 day IL, with a potential return soon. Shane McClanahan hasn't pitched for Tampa Bay in over a year. And I would be remised to not even mention the state of Baltimore's pitching staff. Yes, they did not do a good enough job in the offseason to fill out the rotation, but it cannot be overlooked that almost their entire rotation, as well as key pieces in the lineup, are on the shelf.\r\n\r\nThese are just a short list from **this season** of big names that have sustained some form of injury. As amazing it is, and rightly so, to witness such dominant pitching, coupled with high heat and unhittable offspeed and breaking pitches, the concerns are there. It is always a treat to watch Paul Skenes, Tarik Skubal and Jacob Misiorowski go about their crafts, light up the radar gun, and dominate on a night to night basis, but given the history of the game's best pitchers the last few seasons, its unfortunate that a conversation that can be brought up regarding if any of them can maintain this level while consistently staying on the field. \r\n\r\nAnd yes, injuries are a part of sports, and Tommy John isn't a new injury. In fact the likes of Jacob deGrom, Nathan Eovaldi, both of whom have had it twice, and Justin Verlander, have undergone the procedure and have come back strong. deGrom was an All Star this year and is quietly back to his dominant self, Eovaldi is back to an elite level, and Verlander was able to return and contribute to Houston's 2022 championship team. So its not entirely out of the question that if a player were to go down with this sort if injury that it's the end of the line for them. However, the sharp rise of arm and elbow injuries for pitchers in the last 3 to 5 years is definitely a cause for concern, and the MLB should definitely look into, if they aren't already, how to better prevent its rise and to protect its players.",
    "pinned": false
  },
  {
    "id": 3,
    "title": "The Midsummer Classic: A Spectacle Like No Other",
    "date": "2025-07-17",
    "summary": "In an era where the other of America's big 4 sports cannot seem to get their All Star events right, baseball remains timeless.",
    "image": "/img/dummyimage.png",
    "content": "The National League won 7-6 over the American League in this year's All Star Game thanks to Phillies DH Kyle Schwarber's heroics in the first ever 'swing off' in ASG history. Tied 6-6 after the AL mounted a roaring comeback, Schwarber homered 3 times in 3 swings to clinch victory for the NL, earning him an unprecedented All Star Game MVP award, capping off a thrilling All Star event in Atlanta.\r\n\r\nFrom Cal Raleigh, the league leader in homers, winning the Home Run Derby, Skenes vs Skubal, Kershaw being honored, Pete Alonso's 3 run jack, Corbin Carroll being the first Diamondback to ever homer in the All Star Game, the AL's epic comeback charge, to the first ever swing off to replace extra innings, this  All Star event had it all. And in an era where the other sports can't seem to get it right, with the NBA All Star Game receiving yearly widespread criticism, the NFL Pro Bowl being a lesser viewed event, the NHL only now getting it sort of right with the Four Nations Tournament, only the MLB, and the game of baseball, seems to have stood the test of time.\r\n\r\nMLB's formula for the All Star Game hasn't really changed. It's the derby on the Monday followed by the game on the Tuesday. It's simple yet it works. Sure, maybe its because its the only of the 4 major sports to be on during the summer, but at it's core, even for an exhibition game, it has always been competitive, and its biggest stars always rise to the top. \r\n\r\nThere's something different about the game of baseball where the best always want to play, and competition is always at an all time high. There isn't really any time to 'take a play off' or to 'just go through the motions' even in an event like the All Star Game, because baseball inherently wasn't meant to be played that way. Sure, a pitcher like Skubal or Skenes can just get on the mound and toss 60 MPH pitches, but that's not what they're known for. They *want* to light up the radar gun, they *want* the swing and miss, they *want* to dominate. \r\n\r\nPlayers show up to the game and play in a way that's true to them. Whether it's Jacob Misiorowski's fastball at 102, or Kershaw's signature curveball, or Pete Alonso's power, or Steven Kwan's ability to just put balls in play, these players always put max effort on the biggest stage and showcase why the were elected to represent their respective leagues in this tournament. Maybe it's just that baseball's a simple game to its core - a game between the pitcher and the batter, and sticking to that tradition and fielding the league's very best at what they do will always result in a spectacle that has remained, and will always continue to remain, memorable and timeless.",
    "pinned": false
  },
  {
    "id": 4,
    "title": "A Deeper Dive Into the Yankees Trade Deadline",
    "date": "2025-07-13",
    "summary": "At the All Star Break, the Yankees are scuffling. They have obvious holes and needs, but just how well will they be addressed in just over 2 weeks time?",
    "image": "/img/dummyimage.png",
    "content": "The Yankees have hit their June-July swoon, where they scuffle after a strong start to the season. A mixture of poor defense, hitting, and pitching has gotten them to this point where their once near 10 game lead on the division has now evaporated and the chasing pack has caught up. With the trade deadline a few weeks away, they have obvious holes they need to fix, and as a fan of the team, I wanted to take a closer look at some possible routes they can take.\r\n\r\nThe Yankees have 3 glaring holes: 3B, the starting rotation, and in the bullpen. Starting with thirdbase, after they DFA'd DJ Lemahieu, their need is as apparent as ever. Luckily for them, they have some compelling targets. The main target is Diamondbacks 3B Eugenio Suarez. He is on a tear this season, hitting over 30 homers before the break, and would certainly add that right handed power jolt the Yankees need to their lineup. There are some caveats to this though. He is a rental, meaning that after this season, he can leave the team as a free agent, and do the Yankees justify sending a prospect haul for 2 months of Suarez's services? After all, they did get burned by a rental this past offseason by losing Juan Soto to their crosstown rival Mets. Another thing to point out, though, is that Suarez is not the greatest defender. Despite the bat being a significant upgrade from that position, one where Yankees rank in the bottom 5-10 in overall production, the defense would be only a slight upgrade, which can potentially be troublesome as the Yankees have racked up more than their fair share of errors and defensive miscues as of late. Couple that with the fact that Suarez kind of fits in to the Yankees' lineup problems of the past decade - high power yet high swing and miss. This high risk for reward has continually come back to bite the Yankees especially in the playoffs, where we've seen them get dominated by quality pitching. All in all though, Suarez is an intriguing option because of his power and his bat, but also the Diamondbacks may be in a position to sell, and the Yankees can try do a two-for-one deal by tackling two areas of need by agreeing to a bigger deal involving Suarez and one of the Dbacks' starters in Merrill Kelly or Zac Gallen, both of whom are also on walk years. Certainly an intersting avenue to take, but the Yanks do run the risk of repeating the Mets' mistake of trading away Pete Crow-Armstrong to the Cubs for two months of Javy Baez.\r\n\r\nOther 3B options include Ryan McMahon of the Rockies, Ke'Bryan Hayes of the Pirates, and some outside shouts like Yoan Moncada of the Angels. McMahon and Hayes are other interesting options. I believe the Yankees have been intrigued by McMahon for a few years now, and with good reason. Yes he does play in Colorado and his home and away splits are not the best, but he's a great defender, and on a team like the Yankees, he wouldn't have to be the main guy. He could easily slot in the middle or towards the bottom of the lineup and provide left handed spark, with a swing that can play well to the short porch in Yankee stadium. Ke'Bryan Hayes is another option, and similar to McMahon, he is an excellent defender, in my opinion the best defender in the 3B position in the league. His bat has a lot of work to do, but again, he wouldn't be pressured to be the main guy in the lineup. Moncada is a wildcard, and personally the one I am least excited about. He's had an okay season, but truly has never lived up to the hype he had as a prospect with the White Sox. Again, any of these options would drastically improve the Yankees at 3B, given how poor they have been all season long from this position.\r\n\r\nMoving on to starting pitching, the Yankees do have a need here. With Gerrit Cole's injury before the season's start, there were many question marks surrouding the starting staff, however Fried and Rodon have done well to stabilize the top end, both earning All Star nods, however the back end still remains a bit of a concern. Clarke Schmidt had only recently returned from injury and pitched decently, but has now suffered long term injury after undergoing Tommy John surgery. Ryan Yarbrough, who was slotted as the 5th starter earlier in the season, also has missed significant time, and Marcus Stroman has been uninspiring ever since his return. The Yankees do get Luis Gil, the reigning AL Rookie of the Year winner around the end of the month, but it would be wise for the team not to tax him too much early on and let him build his own rhythm once again. Newly called up rookie Cam Schlittler has shown some promise, after having a strong debut, but has to figure out his command as he continues to grow and develop. Interesting targets include the aforementioned Kelly and Gallen from Arizona, as well as Minnesota's Joe Ryan, and Miami's Sandy Alcantara. There are rumors that the Padres may want to move off Dylan Cease, who is also on a walk year, but that seems unlikely. The market does not seem to be pointing to a strong starting pitching market, so the Yankees may instead pivot and address what's arguably their second biggest need - their bullpen.\r\n\r\nThe Yankees bullpen has been dreadful as of late, posting over a 6 ERA as a unit, and in most cases, singlehandedly costing them games. Luke Weaver dealt with injury but has since returned, though not as effective as in the past. Devin Williams, after a horrid start to his Yankees tenure, has been good of late, but there's still some questions and concerns with him having the ball in the 9th inning. Jonathan Loaisiga also hasn't been his old self. Big names the Yankees can target are Pirates closer David Bednar, a name that has been floated around with the Yankees in the past. Other options include Rockies' Jake Bird, who not a closer, has filthy stuff that can certainly play well on the Yankees especially under pitching coach Matt Blake. Other high end relievers include Giants' Camilo Doval, Tyler Rogers, Cardinals' Ryan Helsely, A's Mason Miller, Padres' Robert Suarez, who like Cease is also on a walk year, Guardians' Emmanuel Clase should they decide to sell, and the best reliever on the market, Twins' Jhoan Duran. \r\n\r\nThat being said, the Yankees do have sustained injuries that they look to get back at some point. As previously mentioned, Gil and Yarbrough will return soon, but this should not be enough to justify standing pat at the deadline and letting things just play out. The Yankees need to make trades this deadline if they want to get back on track. I personally think that the Yankees will pivot away from Suarez, and the likes of Cease and Robert Suarez from the Padres should they be available, as they are rentals. I do believe that the Yankees would prefer players they would have control over, as both Weaver and Williams are set to be free agents at the end of the season. This, in turn, would likely take them off the board for Rogers and Helsely. I also think that they will look towards McMahon or Hayes for 3B, and also look to do a few supplementary trades to acquire better depth, thus moving away from the likes of Escarra and Peraza. I do believe that if they want to trade for a starter, they would have to face a heafty asking price, and it seems that the Yankees do not want to move their top prospects in George Lombard Jr. and Spencer Jones. They also seem to believe in Cam Schlittler and seem hesitant to include him trade packages, which would make it tough to trade for a starter, and should make converstations around relievers interesting, depending on the price that the top relievers like Duran and Miller go for. Much of the Yankees season hangs on what happens in two weeks, and if Cashman and the front office are aggressive and push the right buttons, it can be that jolt they are looking for to righting the ship and getting themselves back on track.",
    "pinned": false
  },
  {
    "id": 5,
    "title": "Pre All Star Game and Trade Deadline Roundup",
    "date": "2025-07-10",
    "summary": "The All Star Game is less than a week away, and despite notable names on the list and an exciting game on the horizon, some are questioning why certain stars are backing out, or why some weren't invited to begin with. Also, 3 weeks remain until the MLB trade deadline, so let's take a look at the state of the market.",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": false
  },
  {
    "id": 6,
    "title": "The 4th of July Weekend has Come and Gone, Looking Ahead Towards the Home Stretch",
    "date": "2025-07-06",
    "summary": "This year's 4th of July weekend saw some blistering heat, both on the field and on the thermometers, a fitting precursor as we head into the dog days of the summer, where races are heating up and teams are finding out what they're truly made of.",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": false
  },
  {
    "id": 7,
    "title": "In An Already Hall of Fame Career, 3,000 is Kershaw's Cherry on Top",
    "date": "2025-07-03",
    "summary": "Clayton Kershaw has finally eclipsed 3,000 career strikeouts - a milestone that is undoubtedly the cherry on top of a sure fire first ballot Hall of Fame career. Let's take a closer dive into his legacy, and peer into the question of if this achievement will ever happen again.",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": false
  },
  {
    "id": 8,
    "title": "With July Around the Corner, Let's Take a Look Around the League",
    "date": "2025-06-29",
    "summary": "Let's take a look around the league. Marquee pitching matchups in Skenes vs. Misiorowski, the Blue Jays battling back in the division, Soto is red hot, and both New York teams are underperforming.",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": false
  },
  {
    "id": 9,
    "title": "The Starters are In, Who Was Left Out?",
    "date": "2025-06-26",
    "summary": "The starters are locked for this year's All Star Game! Who's in and who's not? Did the fans get it right or have they taken it too far?",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": false
  },
  {
    "id": 10,
    "title": "Shohei's Back on the Mound! Can Cal Keep It Up? The AL Wildcard's Heating Up! Latest News and Notable Headlines Here!",
    "date": "2025-06-22",
    "summary": "We take a look around the baseball world: Ohtani back on the mound, Cal Raleigh up to 31 homers, the AL Wildcard Race, Adley Rutschman to the IL and the general state of the Orioles",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": false
  },
  {
    "id": 11,
    "title": "A Tribute to Those Who Have Paved the Way",
    "date": "2025-06-19",
    "summary": "As MLB celebrates Juneteenth, let's take a moment to honor those who paved the way for all of us today.",
    "image": "/img/dummyimage.png",
    "content": "",
    "pinned": false
  }
]